In [2]:
# Q1. List any five functions of the pandas library with execution.
# There are several pandas function some of listed here are Series , Dataframe, read_csv(), head(), tail(), columns, 
#dtypes, categorical, set_index, reset_index, iterrows, apply, sum, min, max, rolling, plot etc

import pandas as pd
l = [1,2,3,4,5]

s1 = pd.Series(l) # Series function to create a series  
l1= [6,7,8,9,10]

s2 = pd.Series(l1)

df = pd.DataFrame([s1,s2]) # Dataframe function to create a dataframe 


df.head(1) # head function is used to display top rows  

df.tail(1) # tail function is used to display bottom rows 

df.columns # range function is used to show all columns


df.dtypes # dtypes function is used to dataframe columns datatypes

df.set_index(2) # set_index function is used to set dataframe columns into index 

df.reset_index() # reset_index function is used to reset dataframe columns

   index  0  1  2  3   4
0      0  1  2  3  4   5
1      1  6  7  8  9  10

In [3]:
# Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.

df = pd.DataFrame({
        "A" : [1,2,3],
        "B" : [4,5,6],
        "C" : [1,2,3]
}, index = [0,1,2])

df

df.index = pd.RangeIndex(start=1, stop=6, step=2)   
df

   A  B  C
1  1  4  1
3  2  5  2
5  3  6  3

In [4]:
'''You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.'''

"You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that\niterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The\nfunction should print the sum to the console."

In [5]:
df = pd.DataFrame({
    "Values" : [10, 20, 30, 40, 50]

})

df


df[0:3].sum()

Values    60
dtype: int64

In [6]:
# Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' 
# that contains the number of words in each row of the 'Text' column.

df = pd.DataFrame({
    "Text" : ['Data Science Impact Batch', 'Start from Jan 23']

})
   

df['Word_Count'] = df['Text'].apply(len)

def wordcount(x):
    
    return len(x.split())
    

df['Word_Count'] = df['Text'].apply(wordcount)


df

                        Text  Word_Count
0  Data Science Impact Batch           4
1          Start from Jan 23           4

In [7]:
# How are DataFrame.size() and DataFrame.shape() different?
# Dataframe.size give dataframe row*column size whereas Dataframe.shape give row column tuple   

df
df.size
df.shape

(2, 2)

In [8]:
# You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

df = pd.DataFrame({
    "email" : ['sandeep@gmail.com', 'pi@gmail.com']

})
   


def username(x):
    
    return x.split('@')[0]    

df['Username'] = df['email'].apply(username)


df

               email Username
0  sandeep@gmail.com  sandeep
1       pi@gmail.com       pi

In [27]:
'''You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.'''

"You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects\nall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The\nfunction should return a new DataFrame that contains only the selected rows."

In [28]:
df3 = pd.DataFrame({

"A":[3,8,6,2,9], 
"B":[5,2,9,3,1],     
"C":[1,7,4,5,2], 


})

In [13]:
df3

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [25]:
df4 = df3[(df3['A']>5) & (df3['B']<10)]

In [26]:
df4

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [29]:
'''Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.'''

"Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,\nmedian, and standard deviation of the values in the 'Values' column."

In [30]:
df4 = pd.DataFrame({

"Value":[10,20,30,40,50]

})

In [32]:
df4.mean()

Value    30.0
dtype: float64

In [33]:
df4.median()

Value    30.0
dtype: float64

In [34]:
'''Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.'''

"Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to\ncreate a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days\nfor each row in the DataFrame. The moving average should be calculated using a window of size 7 and\nshould include the current day."

In [35]:
'''You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.'''

"You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new\ncolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.\nMonday, Tuesday) corresponding to each date in the 'Date' column."

In [44]:
df5 = pd.DataFrame({

"Date": pd.date_range(start = '2023-01-01', end = '2023-01-05')



})

In [45]:
df5

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [46]:
df5['Weekday']=df5['Date'].dt.day_name()

In [47]:
df5

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [48]:
'''Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.'''

"Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python\nfunction to select all rows where the date is between '2023-01-01' and '2023-01-31'."

In [49]:
df6 = pd.DataFrame({

"Date": pd.date_range(start = '2023-01-30', end = '2023-02-04')



})

In [51]:
df6

        Date
0 2023-01-30
1 2023-01-31
2 2023-02-01
3 2023-02-02
4 2023-02-03
5 2023-02-04

In [57]:
df6[df6['Date']< '2023-01-31']

        Date
0 2023-01-30